tap "imshuhao/kdeconnect"
tap "oven-sh/bun"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Emacs dependency management
brew "cask"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package for scientific computing with Python
brew "numpy"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Python library for creating static, animated, and interactive visualizations
brew "python-matplotlib"
# Software for mathematics, science, and engineering
brew "scipy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Privacy-focused app for managing your finances
cask "actual"
# Universal chat app powered by Matrix
cask "beeper"
# Desktop password and login vault
cask "bitwarden"
# E-books management software
cask "calibre"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Client for the Google Drive storage service
cask "google-drive"
# Enabling communication between all your devices
cask "imshuhao/kdeconnect/kdeconnect"
# Free and Open Source Video Editor
cask "kdenlive"
# Electronics design automation suite
cask "kicad"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# VPN client
cask "mullvad-vpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Home media player
cask "plex"
# Music player focusing on visuals
cask "plexamp"
# Minecraft launcher
cask "prismlauncher"
# Control your tools with a few keystrokes
cask "raycast"
# Video game digital distribution service
cask "steam"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
mas "Apple Configurator", id: 1037126344
mas "LINE", id: 539883307
mas "Speedtest", id: 1153157709
mas "WireGuard", id: 1451685025
vscode "astro-build.astro-vscode"
vscode "bramvanbilsen.matlab-code-run"
vscode "brandonfowler.exe-runner"
vscode "chrmarti.regex"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dbaeumer.vscode-eslint"
vscode "doi.fileheadercomment"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "formulahendry.code-runner"
vscode "franneck94.c-cpp-runner"
vscode "fwcd.kotlin"
vscode "geekanant.chrome-dinosaur-game"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ing-bank.vscode-psl"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "mathiasfrohlich.kotlin"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "mshr-h.veriloghdl"
vscode "randomfractalsinc.vscode-data-preview"
vscode "redhat.java"
vscode "sohibe.java-generate-setters-getters"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
cargo "r-matrix"
